## Plan Result (prod_frontdoor)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 25 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;court-tribunal-hearings&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;court-tribunal-hearings-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;court-tribunal-hearings-b2c-staff&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;dts-legacy-apps---certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;dts-legacy-apps---civilappeals-casetracker&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;dts-legacy-apps---courtfines&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;dts-legacy-apps---immigration-appeals-iacfees&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;dts-legacy-apps---utiac&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;ejudiciary-home&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;ejudiciary-home-apex&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;ejudiciary-home-www&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;jd-bureau&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;jd-reply-jury-summons&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;netbox&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;portal&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;sds-build&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;sds-sandbox-build&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;static-sds-sandbox-build&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;vh-video-web&#34;]
* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;ejudiciary-home-apex&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Replace
  * module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate[&#34;ejudiciary-home-apex&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["ejudiciary-home-apex"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/customDomains/ejudiciary-home-apex"
        name                     = "ejudiciary-home-apex"
        # (3 unchanged attributes hidden)

      ~ tls {
          ~ cdn_frontdoor_secret_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/secrets/ejudiciaryhomeapex-managed-secret" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_secret.certificate["ejudiciary-home-apex"] must be replaced
-/+ resource "azurerm_cdn_frontdoor_secret" "certificate" {
      + cdn_frontdoor_profile_name = (known after apply)
      ~ id                         = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod/secrets/ejudiciaryhomeapex-managed-secret" -> (known after apply)
        name                       = "ejudiciaryhomeapex-managed-secret"
        # (1 unchanged attribute hidden)

      ~ secret {
          ~ customer_certificate {
              ~ key_vault_certificate_id  = "https://acmedtssdsprod.vault.azure.net/certificates/ejudiciary-net/fb3d4ff568654816944ef1a507c7731a" -> "https://acmedtssdsprod.vault.azure.net/certificates/ejudiciary-net/b31e703227dc44708c9f13401f6b79c7" # forces replacement
              ~ subject_alternative_names = [
                  - "*.ejudiciary.net",
                  - "ejudiciary.net",
                ] -> (known after apply)
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["c100-application"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.c100-application"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["court-tribunal-hearings"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.www"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "court-tribunal-hearings.service.gov.uk"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["court-tribunal-hearings-b2c-sign-in"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.sign-in"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "court-tribunal-hearings.service.gov.uk"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["court-tribunal-hearings-b2c-staff"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.staff"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "court-tribunal-hearings.service.gov.uk"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["dts-legacy-apps---certificatedbailiffs"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.waf"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "certificatedbailiffs.justice.gov.uk"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["dts-legacy-apps---civilappeals-casetracker"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.waf"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "casetracker.justice.gov.uk"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["dts-legacy-apps---courtfines"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.waf"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "courtfines.direct.gov.uk"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["dts-legacy-apps---immigration-appeals-iacfees"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.waf"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "immigrationappealsonline.justice.gov.uk"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["dts-legacy-apps---utiac"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.waf"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "tribunalsdecisions.service.gov.uk"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["ejudiciary-home"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.home"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ejudiciary.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["ejudiciary-home-apex"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ejudiciary.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["ejudiciary-home-www"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.www"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ejudiciary.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["jd-bureau"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "juror-bureau.justice.gov.uk"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["jd-reply-jury-summons"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "reply-jury-summons.service.gov.uk"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["netbox"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.netbox"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["portal"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.portal"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "pre-recorded-evidence.justice.gov.uk"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["pre-portal"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.pre-portal"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["sds-api-mgmt"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.sds-api-mgmt"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["sds-build"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.sds-build"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["sds-sandbox-build"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.sds-sandbox-build"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["static-sds-sandbox-build"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.static-sds-sandbox-build"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["toffee"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.toffee"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["vh-admin-web"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.admin"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hearings.reform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["vh-video-web"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.video"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "hearings.reform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 25 to add, 2 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":628,"Program":"tfcmt","SHA1":"","Target":"prod_frontdoor","Vars":{}} -->